{
  "name": "Kaushal H. Nagar",
  "Job Role": "iOS and React Native Developer",
  "contactInfo": [
    "📞 6352599059",
    {
      "email": "kaushalnagar997@gmail.com",
      "url": "mailto:kaushalnagar997@gmail.com"
    },
    {
      "linkedin": "linkedin.com/in/kaushal-nagar997",
      "url": "https://linkedin.com/in/kaushal-nagar997"
    }
  ],
  "about": [
    "Results-driven iOS and React Native (cross-platform) Developer with hands-on experience in building robust, scalable, and high-performance applications. Proficient in Swift, UIKit, and MapKit, with expertise in real-time communication using Core Location. Skilled in optimizing memory management and enhancing app performance through efficient coding practices. Experienced in implementing XCTest for thorough testing and maintaining code quality.",
    "Proven track record in leading complete mobile app lifecycles - from concept to deployment - for diverse projects including CRM, e-commerce, logistics, and healthcare applications and Passionate about clean architecture, efficient coding practices, and emerging technologies.",
    "Specialized in offline-first architectures with implementations in both SQLite (iOS) and Realm (React Native), ensuring seamless functionality in low-connectivity scenarios.",
    "Expert in real-time features implementation including Socket.IO for messaging, Core Location for live tracking, and VoIP/SIP for calling functionality in mobile apps.",
    "Passionate about performance optimization with achievements like handling 6GB image uploads with <50MB memory usage and smooth scrolling through thousands of chat messages.",
    "Skilled in UI/UX design principles with experience creating child-friendly interfaces for special needs users and optimizing user flows for better engagement metrics.",
    "Technical leader with experience managing developer communities (Google DSC) and mentoring 700+ members through workshops on mobile development best practices.",
    "Strong background in both technical implementation and project leadership, having successfully delivered 7+ mobile applications across various domains."
  ],
  "skills": {
    "Programming Languages": "C, Python, Swift, React Native, SwiftUI, HTML5, CSS3, JavaScript, TypeScript",
    "iOS Frameworks": "UIKit, Core Animation, Core Location, AVFoundation, MapKit, CocoaPods",
    "Databases": "SQL, SQLite, Core Data, Realm DB ( By MongoDB )",
    "Software Architecture": "OOP, MVC, MVVM",
    "Developer Tools": "Git, GitHub, GitLab, VS Code, Xcode, Pycharm, IntelliJ IDEA, Android Studio, Postman",
    "Testing": "XCTest, Unit Testing, UI Testing, Debugging",
    "Operating Systems": "Windows, MacOs, Linux",
    "Designing Tools": "Figma, Adobe XD, Storyboards, Auto Layout, Photoshop, Lightroom, After Effects, Premiere Pro",
    "Agile Methodologies": "Kanban, JIRA, Active Collab",
    "Other Software": "OBS Studio",
    "Soft Skills": "Team Leadership, Communication, Problem Solving, Analytical Skills, Time Management",
    "Other Skills": "Ethical Hacking, Rubik's Cube Solver (2 Min)"
  },
  "experience": [
    {
      "position": "iOS ( Swift/SwiftUI ) and React Native Developer",
      "company": "Webcodegenie Pvt Ltd",
      "duration": "April 2024 – Present",
      "responsibilities": [
        {
          "project": "Mario Customer & Mario Driver Apps ( iOS Swift )",
          "details": [
            {
              "title": "Socket Implementation:",
              "description": "Enabled real-time communication by implementing sockets for improved data transfer across screens."
            },
            {
              "title": "Real-Time Features:",
              "description": "Developed live location tracking system with MapKit and Core Location, enabling real-time path drawing with 95% accuracy for enhanced user experience."
            },
            {
              "title": "Bulk Image Upload:",
              "description": "Developed an optimized feature for uploading and displaying up to 6GB of images using minimal memory (under 50MB)."
            },
            {
              "title": "Enhanced UI/UX:",
              "description": "Designed and implemented custom UI components with Core Animation, resulting in 30% improvement in app engagement metrics."
            },
            {
              "title": "Unit Testing & Quality Assurance:",
              "description": "Implemented Unit Testing using XCTest, ensuring reliable and bug-free code with major code coverage."
            }
          ]
        },
        {
          "project": "GoMow Crew (iOS App with Offline Capabilities)",
          "details": [
            {
              "title": "Offline-First Architecture:",
              "description": "Implemented SQLite for robust offline data management, enabling full functionality without internet connectivity with automatic sync when online."
            },
            {
              "title": "Data Synchronization:",
              "description": "Developed conflict resolution strategies for bi-directional sync between local SQLite and cloud database, ensuring data consistency."
            }
          ]
        },
        {
          "project": "Yallah Chiaka ( iOS Swift )",
          "details": [
            {
              "description": "Played a key role in the end-to-end design and development of a clothing e-commerce app from the ground up."
            },
            {
              "description": "Designed and developed 30+ dynamic screens in a 5-6 day timeframe for the initial demo."
            }
          ]
        },
        {
          "project": "Pictogram (React Native App for Autism Support)",
          "details": [
            {
              "title": "Local Notification System:",
              "description": "Implemented a comprehensive local notification scheduling system eliminating backend dependency, ensuring reliable reminders for daily tasks and activities."
            },
            {
              "title": "Offline-First Architecture:",
              "description": "Integrated Realm by MongoDB as local database solution, enabling full offline functionality for users with intermittent internet access."
            },
            {
              "title": "Child-Centric UI/UX:",
              "description": "Designed intuitive, visually clear interfaces specifically tailored for children with autism, using color psychology and simplified navigation patterns."
            },
            {
              "title": "Progress Tracking:",
              "description": "Developed mood and task completion tracking system with visual analytics to help caregivers monitor progress over time."
            },
            {
              "title": "Performance Optimization:",
              "description": "Achieved smooth performance on low-end devices through efficient memory management and optimized database queries."
            }
          ]
        },
        {
          "project": "Sales CRM (React Native Mobile App)",
          "details": [
            {
              "title": "End-to-End Project Leadership:",
              "description": "Led the complete development lifecycle of the Sales CRM mobile application from concept to deployment, coordinating between cross-functional teams."
            },
            {
              "title": "Advanced Socket Implementation:",
              "description": "Engineered real-time messaging system using Socket.IO, implementing presence detection, typing indicators, and message delivery status with optimized reconnection strategies."
            },
            {
              "title": "Communication Suite Implementation:",
              "description": "Integrated comprehensive communication features including SIP calling (VoIP), WhatsApp messaging, and SMS chat functionality within the app."
            },
            {
              "title": "Contact Management System:",
              "description": "Developed a robust contact management system with synchronization capabilities to device contacts."
            },
            {
              "title": "Call History & Analytics:",
              "description": "Implemented detailed call history tracking with duration, timestamps, and call outcome categorization, plus visual analytics dashboard."
            },
            {
              "title": "Real-Time Messaging:",
              "description": "Engineered real-time chat functionality with Socket.IO, implementing presence detection, typing indicators, and message status tracking."
            },
            {
              "title": "Cross-Platform Compatibility:",
              "description": "Ensured seamless functionality across both iOS and Android platforms with platform-specific optimizations for calling features following with Atomic Design principles for scalability."
            }
          ]
        },
        {
          "project": "GoMow Customer (React Native App)",
          "details": [
            {
              "title": "Legacy System Modernization:",
              "description": "Transformed outdated codebase to modern React Native architecture, improving maintainability and reducing bug reports by 40%."
            },
            {
              "title": "UI/UX Optimization:",
              "description": "Redesigned core user flows with React Navigation, implementing smooth animations using Reanimated, resulting in improved user retention."
            },
            {
              "title": "API Layer Refactor:",
              "description": "Implemented Axios interceptors for centralized error handling, improving API success rate to 99.8%."
            }
          ]
        }
      ]
    },
    {
      "position": "Technical Community Leader",
      "company": "Google Developer Student Club & Ed-Tech Platforms",
      "duration": "July 2022 – August 2023",
      "responsibilities": [
        {
          "title": "Google Developer Student Club Lead:",
          "description": "Founded and led Google developer community, organizing 25+ technical workshops on GCP, Kotlin, Flutter, and resume building. Organized GDSC WOW Gujarat 2023 (700+ attendees)."
        },
        {
          "title": "Technical Community Head:",
          "description": "Led and Managed developer communities for Algozenith, Coding Blocks, Coding Ninja, Skill-Lync, and TechLearn, fostering technical growth among members."
        }
      ]
    },
    {
      "position": "Content & Operations Specialist",
      "company": "FreeCo & Epitome Webcasting",
      "duration": "Feb 2021 – Nov 2021",
      "responsibilities": [
        {
          "title": "Content Development:",
          "description": "Authored SEO-friendly articles and served as SME for mathematics, physics, and chemistry content."
        },
        {
          "title": "Technical Operations:",
          "description": "Performed data entry/verification and assisted webcasting operations (equipment setup, live monitoring, video editing/uploading)."
        }
      ]
    }
  ],
  "projects": [
    {
      "name": "Music Player (iOS Swift App)",
      "description": "Built a fully functional music player with audio playback and media controls using AVFoundation and AVPlayer."
    },
    {
      "name": "Tic-Tac-Toe Game (iOS Swift App)",
      "description": "Developed a game with dynamic UI updates and game logic using Swift."
    },
    {
      "name": "E-commerce App (iOS Swift App)",
      "description": "Designed and developed a full-fledged e-commerce platform with product listings."
    },
    {
      "name": "Smart IoT Thing Detection Bag",
      "description": "Smart bag using IoT sensors and machine learning to detect and identify objects inside. Provides information and alerts to the user's smartphone or smartwatch. Selected for funding by SSIP, a Government of Gujarat scheme, promoting student entrepreneurship and innovation."
    },
    {
      "name": "Portfolio Website",
      "description": "Personal portfolio website built with HTML, CSS, and JavaScript."
    }
  ],
  "certifications": [
    {
      "name": "Google Developer Student Club Lead",
      "issuer": "Google",
      "year": "2023"
    }
  ],
  "education": [
    {
      "degree": "B.E. Computer Science",
      "institution": "Government Engineering College, Patan (GTU)",
      "year": "2020 - 2024",
      "grade": "CGPA: 7.52"
    },
    {
      "degree": "HSC",
      "institution": "Nilkanth Vidhyalay, Limbdi (GSEB, Gandhinagar)",
      "year": "2019 - 2020",
      "grade": "Percentage: 57%"
    },
    {
      "degree": "SSC",
      "institution": "S.T. Thomash School, Limbdi (GSEB, Gandhinagar)",
      "year": "2017 -  2018",
      "grade": "Percentage: 73.33%"
    }
  ]
}
